backgroundMesh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  C hin's        | Made with: Chin's BlockMeshAuto                 |
|  \\    /   H andy         |                                                 |
|   \\  /    I nterface &   | Project:  {project_name}  |
|    \\/     N avigation    |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    ( -10.000000 1.000000 0.000000 )  // point 0
    ( -10.000000 -5.000000 0.000000 )  // point 1
    ( 9.000000 -5.000000 0.000000 )  // point 2
    ( -10.000000 -1.000000 0.000000 )  // point 3
    ( 9.000000 5.000000 0.000000 )  // point 4
    ( -10.000000 5.000000 0.000000 )  // point 5
    ( -10.000000 -5.000000 1.000000 )  // point 6
    ( 9.000000 -5.000000 1.000000 )  // point 7
    ( 9.000000 5.000000 1.000000 )  // point 8
    ( -10.000000 5.000000 1.000000 )  // point 9
    ( -10.000000 1.000000 1.000000 )  // point 10
    ( -10.000000 -1.000000 1.000000 )  // point 11
    ( 9.000000 -1.000000 0.000000 )  // point 12
    ( 9.000000 1.000000 0.000000 )  // point 13
    ( 9.000000 -1.000000 1.000000 )  // point 14
    ( 9.000000 1.000000 1.000000 )  // point 15
);

blocks
(
    hex (0 13 4 5 10 15 8 9)        (38 8 2)        simpleGrading (1.0 1.0 1.0)        // Block 0
    hex (1 2 12 3 6 7 14 11)        (38 8 2)        simpleGrading (1.0 1.0 1.0)        // Block 1
    hex (3 12 13 0 11 14 15 10)        (38 4 2)        simpleGrading (1.0 1.0 1.0)        // Block 2
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (5 9 8 4)
            (0 10 9 5)
            (13 4 8 15)
            (1 2 7 6)
            (1 6 11 3)
            (2 12 14 7)
            (3 11 10 0)
            (12 13 15 14)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 5 4 13)
            (10 15 8 9)
            (1 3 12 2)
            (6 7 14 11)
            (3 0 13 12)
            (11 14 15 10)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
